ednieuw/ESP32SerialNTP-BLE-Clock/ESP32C3S3_SerialClockV010/ESP32C3S3_SerialClockV010.ino
 Serial.setDebugOutput(true);                                                                 // Serial.setDebugOutput(true); activates the LOG output to the Serial object, which in this case is attached to the USB CDC port.
 Tekstprintln("Serial started at 9600 baud");                                                 // Turn on Red LED
 SetStatusLED(0,0,0,0,10);
 delay(1000);
                         #ifdef ESP32C3_DEV
 pinMode(REDPIN,     OUTPUT);
 pinMode(GREENPIN,   OUTPUT);
 pinMode(BLUEPIN,    OUTPUT);
 pinMode(COLD_WHITE, OUTPUT);
 pinMode(WARM_WHITE, OUTPUT);     
                        #endif //ESP32C3_DEV    
                        #ifdef ESP32C3_SUPERMINI
 pinMode(LEDPIN,     OUTPUT);
                        #endif //ESP32C3_SUPERMINI

                        #ifdef NANOESP32 
  pinMode(LED_RED,   OUTPUT);
  pinMode(LED_GREEN, OUTPUT);
  pinMode(LED_BLUE,  OUTPUT);
  pinMode(LED_BUILTIN, OUTPUT);
                        #endif //NANOESP32
                        #ifdef ESP32S3_ZERO
  strip.begin();                                                                              // INITIALIZE NeoPixel strip object (REQUIRED)
  strip.show();                                                                               // Turn OFF all pixels ASAP
  strip.setBrightness(BRIGHTNESS);
  for(uint32_t i=0; i<255; i++){strip.setPixelColor(0, i*250);strip.show();  delay(2); }
                           #endif // ESP32S3_ZERO  

 SetStatusLED(0,0,10,0,0);                                                                    // Set the status LED to red
 InitStorage();                           Tekstprintln("Setting loaded");                     // Load settings from storage and check validity 
 if(Mem.BLEOn) StartBLEService();         Tekstprintln("BLE started");                        // Start BLE service
 if(Mem.WIFIOn){ Tekstprintln("Starting WIFI");  StartWIFI_NTP();   }                         // Start WIFI and optional NTP if Mem.WIFIOn = 1      
 SWversion();                                                                                 // Print the menu + version 
 GetTijd(0);                                                                                  // 
 Print_RTC_tijd();
 PrintTimeToSerial1(); 
 msTick = millis(); 
}
//--------------------------------------------                                                //
// ARDUINO Loop
//--------------------------------------------
void loop() 
{
 Loopcounter++;
 EverySecondCheck();  
 CheckDevices();
}
//--------------------------------------------
// Common Check connected input devices
//--------------------------------------------
void CheckDevices(void)
{
 CheckBLE();                                                                                  // Something with BLE to do?
 SerialCheck();                                                                               // Check serial port every second 
 Serial1Check();                                                                               // Check serial port every second 
 ElegantOTA.loop();                                                                           // For Over The Air updates This loop block is necessary for ElegantOTA to handle reboot after OTA update.
}
//--------------------------------------------                                                //
// CLOCK Update routine done every second
//--------------------------------------------
void EverySecondCheck(void)
{
 static int Toggle = 1;
 uint32_t msLeap = millis() - msTick;                                                         // 
 if (msLeap >999)                                                                             // Every second enter the loop
   {
    msTick = millis();
    GetTijd(0);                                                                               // get the time for the seconds 
    Toggle = 1-Toggle;   
    UpdateStatusLEDs(Toggle);
    if (timeinfo.tm_min != lastminute) EveryMinuteUpdate();                                   // Enter the every minute routine after one minute; 
    Loopcounter=0;
   }    
 }
//--------------------------------------------
// CLOCK Update routine done every minute
//-------------------------------------------- 
void EveryMinuteUpdate(void)
{   
 lastminute = timeinfo.tm_min;  
 if(timeinfo.tm_min % 6 == 3)  PrintTimeToSerial1();                                          // Print the Ttimestring to the serial port
 //  if(WiFi.localIP()[0]>0) WIFIConnected = true; else WIFIConnected = false;                // To be sure connection is still there
 if(timeinfo.tm_hour != lasthour) EveryHourUpdate();
}
//--------------------------------------------
// CLOCK Update routine done every hour
//--------------------------------------------
void EveryHourUpdate(void)
{
 if(WiFi.localIP()[0]==0)
   {
     sprintf(sptext, "Disconnected from station, attempting reconnection");
     Tekstprintln(sptext);
     WiFi.reconnect();
   }
 lasthour = timeinfo.tm_hour;
 if (!Mem.StatusLEDsOn) SetStatusLED(0,0,0,0,0);                                               // If for some reason the LEDs are ON and after a MCU restart turn them off.  
 if (timeinfo.tm_mday != lastday) EveryDayUpdate();  
}
//--------------------------------------------                      SetStatusLED               //
// CLOCK Update routine done every day
//------------------------------------------------------------------------------
void EveryDayUpdate(void)
{
 if(timeinfo.tm_mday != lastday) 
   {
    lastday = timeinfo.tm_mday; 
//    StoreStructInFlashMemory();                                                             // 
    }
}
//--------------------------------------------                                                //
// COMMON Update routine for the status LEDs
//-------------------------------------------- 
void UpdateStatusLEDs(int Toggle)
{
 if (Mem.StatusLEDsOn)   
     {
   if(Toggle) 
         { 
          SetStatusLED(0,0,0,WIFIConnected*10,deviceConnected*10);
          digitalWrite(LED_BUILTIN, LOW); 
         }
    else     
        {
          SetStatusLED(0,0,0,0,0);
         digitalWrite(LED_BUILTIN, HIGH);                                                   // on Nano ESP32 Turn the LED on
        }

