ednieuw/ESP32SerialNTP-BLE-Clock/ESP32C3S3_SerialClockV010/ESP32C3S3_SerialClockV010.ino
     }
     else
     {
      SetStatusLED(0,0,0,0,0); 
      digitalWrite(LED_BUILTIN, HIGH);                                                  // Turn the LED off by making the voltage HIGH
     }
}
//--------------------------------------------
// Common check for serial input
//--------------------------------------------
void SerialCheck(void)
{
 String SerialString; 
 while (Serial.available())
    { 
     char c = Serial.read();                                                                  // Serial.write(c);
     if (c>31 && c<128) SerialString += c;                                                    // Allow input from Space - Del
     else c = 0;                                                                              // Delete a CR
    }
 if (SerialString.length()>0) 
    {
     Serial1.println(SerialString);
     ReworkInputString(SerialString);  
     SerialString = "";
    }
}
//--------------------------------------------
// Common check for serial input
//--------------------------------------------
void Serial1Check(void)
{
 String SerialString; 
 while (Serial1.available())
    { 
     char c = Serial1.read();                                                                  // Serial.write(c);
     SerialString += c;                                                                        // Allow input from Space - Del
     if (c==13) break;                                                                         // exit on CR
    }
 if (SerialString.length()>0) 
    {
     sprintf(sptext,"%s",SerialString.c_str());    Tekstprint(sptext);                        // Print to Ser0/USB and BLE 
     SerialString = "";
    }
}
//--------------------------------------------                                                //
// Common Reset to default settings
//------------------------------------------------------------------------------
void Reset(void)
{
 Mem.Checksum         = 25065;                                                                //
 Mem.TurnOffLEDsAtHH  = 0;                                                                    // Display Off at nn hour
 Mem.TurnOnLEDsAtHH   = 0;                                                                    // Display On at nn hour Not Used
 Mem.BLEOn            = 1;                                                                    // BLE On
 Mem.UseBLELongString = 0;
 Mem.NTPOn            = 0;                                                                    // NTP On
 Mem.WIFIOn           = 0;                                                                    // WIFI On  
 Mem.ReconnectWIFI    = 0;                                                                    // Correct time if necesaary in seconds
 Mem.WIFINoOfRestarts = 0;                                                                    //  
 Mem.UseSDcard        = 0;

 strcpy(Mem.Ssid,"");                                                                         // Default SSID maxlen = 30
 strcpy(Mem.Password,"");                                                                     // Default password maxlen = 40
 strcpy(Mem.BLEbroadcastName,"ESP32WordClock");                                               // MaxLen string is 30
 strcpy(Mem.Timezone,"CET-1CEST,M3.5.0,M10.5.0/3");                                           // Central Europe, Amsterdam, Berlin etc.
 // For debugging
// strcpy(Mem.Ssid,"Guest");
// strcpy(Mem.Password,"guest_001");
// Mem.NTPOn        = 1;                                                                     // NTP On
// Mem.WIFIOn       = 1;                                                                     // WIFI On  

 Tekstprintln("**** Reset of preferences ****"); 
 StoreStructInFlashMemory();                                                                  // Update Mem struct       
 GetTijd(0);                                                                                  // Get the time and store it in the proper variables
 SWversion();                                                                                 // Display the version number of the software
}
//--------------------------------------------                                                //
// Common common print routines
//--------------------------------------------
void Tekstprint(char const *tekst)    { if(Serial) Serial.print(tekst); SendMessageBLE(tekst); sptext[0]=0;   } //
void Tekstprintln(char const *tekst)  { sprintf(sptext,"%s\n",tekst); Tekstprint(sptext);  }
void TekstSprint(char const *tekst)   { printf(tekst); sptext[0]=0;}                          // printing for Debugging purposes in serial monitor 
void TekstSprintln(char const *tekst) { sprintf(sptext,"%s\n",tekst); TekstSprint(sptext); }

//------------------------------------------------------------------------------
//  Common Constrain a string with integers
// The value between the first and last character in a string is returned between the low and up bounderies
//------------------------------------------------------------------------------
int SConstrainInt(String s,byte first,byte last,int low,int up){return constrain(s.substring(first, last).toInt(), low, up);}
int SConstrainInt(String s,byte first,          int low,int up){return constrain(s.substring(first).toInt(), low, up);}
//--------------------------------------------                                                //
// Common Init and check contents of EEPROM
//--------------------------------------------
void InitStorage(void)
{
 // if(!SPIFFS.begin(FORMAT_SPIFFS_IF_FAILED)){ Tekstprintln("Card Mount Failed");   return;}
 // else Tekstprintln("SPIFFS mounted"); 

 GetStructFromFlashMemory();
 if( Mem.Checksum != 25065)
   {
    sprintf(sptext,"Checksum (25065) invalid: %d\n Resetting to default values",Mem.Checksum); 
    Tekstprintln(sptext); 
    Reset();                                                                                  // If the checksum is NOK the Settings were not set
   }
 if(strlen(Mem.Password)<5 || strlen(Mem.Ssid)<3)     Mem.WIFIOn = Mem.NTPOn = 0;       // If ssid or password invalid turn WIFI/NTP off
 
